{
  "number": 20250417,
  "messages": [
    {
      "ymd": "2025/4/16",
      "ja": "【お知らせ】アプリの仕様変更について\n\n「Play ストアの開発者アカウント廃止」および「Amazonアプリストアでの配信終了」に伴い、アプリの仕様を以下のとおり変更しました。\n\n・時刻表の更新方式を変更しました\n　従来のアプリ同梱から、ダウンロードによる更新方式に移行しました。今後、アプリの更新は不要になります。\n　アプリ起動時などに自動で更新を確認し、必要に応じて時刻表をダウンロードします。\n\n・アプリストア経由での更新を停止します\n　Play ストアおよび Amazon アプリストアでの更新は今後行いません。\n　新規インストールやアップデートが必要な場合は、GitHub から apk ファイルを手動でダウンロード・インストールしてください。\n",
      "en": "【Notice】Changes to App Specifications\n\nDue to the termination of the Play Store developer account and the end of distribution on the Amazon Appstore, we have made the following changes to the app:\n\n・Timetable update method has been changed\n　The timetable is no longer bundled with the app. It will now be updated via download.\n　As a result, app updates are no longer required.\n　The app will automatically check for updates at startup and download the latest timetable if needed.\n\n・Updates via app stores have been discontinued\n　We will no longer provide updates through the Play Store or Amazon Appstore.\n　For new installations or necessary updates, please manually download and install the APK file from GitHub."
    },
    {
      "ymd": "2025/4/15",
      "ja": "このアプリについて\n\n島根県・隠岐諸島の航路に関する運航情報および時刻表を確認できるアプリです。\n隠岐汽船のフェリー・超高速船レインボージェット、ならびに隠岐観光が運航する島前連絡船（内航船）に対応しています。\n\n・本アプリは運航会社が提供する公式アプリではありません。\n\n・時刻表データの正確性には万全を期していますが、内容の誤りにより利用者に損害が生じた場合でも、作者は一切の責任を負いません。免責事項に同意いただけない場合は、ご利用をお控えください。\n\n・本アプリは諸事情により、Google Play ストアおよび Amazon アプリストアでの配信を終了し、現在は GitHub にて提供しています。\n　今後も状況により、アプリの更新や時刻表データの提供が停止される可能性があります。\n\nGithub上のこのアプリのプロジェクト\nhttps://github.com/okiislandsh/OkiFerries\n\nPlayStore デベロッパーアカウント (アカウントBANされる予定)\nhttps://play.google.com/store/apps/dev?id=6502094932138875905\n\nPlayStore 隠岐航路時刻表 (アカウントBANされる予定)\nhttps://play.google.com/store/apps/details?id=jp.okiislandsh.oki.schedule\n\nAmazon アプリストア 隠岐航路時刻表 (Amazonは2025年8月20日に、アプリストアのAndroidサポートを終了します)\nhttp://www.amazon.co.jp/gp/mas/dl/android?p=jp.okiislandsh.oki.schedule.amzn\n\nリリースノート\nhttps://sites.google.com/view/shima-app-release-note\n\nプライバシーポリシー\nhttps://sites.google.com/view/oki-ferries-privacy-policy\n\nアプリ利用ライセンス\nhttps://sites.google.com/view/oki-ferries-privacy-policy/license\n\n開発関連 Blogger\nhttps://okiislandsh.blogspot.com/",
      "en": "This app provides ferry and high-speed boat schedules and operational information for the Oki Islands in Shimane Prefecture, Japan.\nIt covers the Oki Kisen ferries and Rainbow Jet, as well as the inter-island boats (local lines) operated by Oki Kanko.\n\n・Please note that this app is not an official product of any ferry or transport company.\n\n・While every effort has been made to ensure the accuracy of the timetable data, the developer takes no responsibility for any damages resulting from errors in the information.\n　If you do not agree to this disclaimer, please refrain from using the app.\n\n・Due to various circumstances, the app is no longer distributed via Google Play Store or Amazon Appstore.\n　It is now available on GitHub.\n　Please note that future updates or timetable data may also be discontinued without prior notice.\n\nGitHub project for this app\nhttps://github.com/okiislandsh/OkiFerries\n\nPlay Store developer account (scheduled to be banned)\nhttps://play.google.com/store/apps/dev?id=6502094932138875905\n\nPlay Store – Oki Ferries Timetable (scheduled to be banned)\nhttps://play.google.com/store/apps/details?id=jp.okiislandsh.oki.schedule\n\nAmazon Appstore – Oki Ferries Timetable (Amazon will end Android Appstore support on August 20, 2025)\nhttp://www.amazon.co.jp/gp/mas/dl/android?p=jp.okiislandsh.oki.schedule.amzn\n\nRelease notes\nhttps://sites.google.com/view/shima-app-release-note/english\n\nPrivacy policy\nhttps://sites.google.com/view/oki-ferries-privacy-policy\n\nApp usage license\nhttps://sites.google.com/view/oki-ferries-privacy-policy/license\n\nDeveloper blog (Blogger)\nhttps://okiislandsh.blogspot.com/"
    }
  ]
}